NetBeansProjects/ejbClient/src/java/1.xml

<env:Envelope xmlns:env='http://schemas.xmlsoap.org/soap/envelope/'><env:Header><ns1:SOAP_SERVICE_HOST_IP xmlns:ns1='http://services.bigpond.com/headers'>10.120.72.12</ns1:SOAP_SERVICE_HOST_IP><ns1:SystemName xmlns:ns1='http://services.bigpond.com/headers'>OSP</ns1:SystemName><ns1:SOAP_SERVICE_HOST_NAME xmlns:ns1='http://services.bigpond.com/headers'>nsbwyweba20</ns1:SOAP_SERVICE_HOST_NAME><ns1:FE_CorrelationId xmlns:ns1='http://services.bigpond.com/headers'>C22BA26D11898F36F6341A217585AD63_1377043457203_1377043457278</ns1:FE_CorrelationId></env:Header><env:Body><SetUpRequest xmlns="http://telstra.com/payments/gimmi/setup/SetUpRequest" xmlns:ns2="http://telstra.com/payments/gimmi/setup/SetUpResponse"><header><serviceDomain>PostPaid</serviceDomain><serviceClass>GIMMI External</serviceClass><serviceId>Setup</serviceId><organisationId>Telstra</organisationId><systemId>Telstra Digital</systemId><subSystemId>OSP-CC-MyAccount</subSystemId><user>U0006685476</user><userType>TUID</userType><crn xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><version>1.0</version><timestamp>2013-08-21T10:04:17.356+10:00</timestamp><security><serverId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><systemSecurityToken xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><userSecurityToken xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/></security></header><gimmiConsumerSegment><consumerReturnURL>https://www.my.telstra.com.au/myaccount/paymybill-receipt-cc?p=UNKNOWN-9dcdf3db153f6eceb8963287f121b0fe919205b3&amp;pid=7ace147d-741c-46e5-b791-b914cf4c0b77</consumerReturnURL><consumerReferenceType>BILLPAY-ID</consumerReferenceType><consumerReferenceID xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><consumerInfoMessage xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><transactionDescription>OSP Payment</transactionDescription><gimmiProxyType>Registration</gimmiProxyType><userInteractionType>Direct Post Method</userInteractionType></gimmiConsumerSegment><fiMetaData><finInstrumentType>Credit Card</finInstrumentType><finInstrumentReferenceType>Contact ID</finInstrumentReferenceType><finInstrumentReference>1-19FBYDRU</finInstrumentReference><finInstrumentInstance xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/></fiMetaData><paymentData><paymentType xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><finInstrumentPresence xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><finInstrumentReferenceType xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><finInstrumentReference xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><finInstrumentInstance xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><amount xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><doDuplicateCheck xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><priority xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><rrn xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><statement xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><authId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/></paymentData><custDetails><firstName xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><surName xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><businessName xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><abn xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><billingAddress1 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><billingAddress2 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><state xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><postCode xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><contactPhone xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><emailAddress xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/></custDetails><serviceInfo><accountNumber xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><billNumber xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><secondaryNumber xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/></serviceInfo></SetUpRequest></env:Body></env:Envelope>
